[
  {
    "id": 100,
    "title": "About Us",
    "sector": "Page",
    "description": "Tiger design credit : Shadow Sniper",
    "tags": [
      "about",
      "franchise",
      "business",
      "opportunity"
    ],
    "slug": "about-us"
  },
  {
    "id": 548,
    "title": "Request a call back from experts",
    "sector": "Page",
    "description": "Hello Investor! Planning to start a new business in India? Scared of the risks involved? Want to know the investment requirements? Need to learn the setup process? Need to get the funding for business? Need to think logically for decision making? Want to take a less risky and informed decision? Want an expert to explain the business concept(s)? Request an expert callback at just ₹249 now here! IF YOUR ANSWER TO ABOVE QUESTIONS IS YES Join us this whole week in our event called 'TigerTalk'. Ti...",
    "tags": [
      "request",
      "call",
      "back",
      "from",
      "experts",
      "expert",
      "franchise",
      "business",
      "opportunity"
    ],
    "slug": "expert-call-back"
  },
  {
    "id": 777,
    "title": "Business Development Intern Required",
    "sector": "Page",
    "description": "About Us: FranTiger Business Consulting Private Limited started in 2017 at Silicon Valley of India, Bengaluru. It is Asia’s first integrated services provider and aggregator for Franchise Consulting, Business Brokerage & Turnkey projects. The founder & CEO Ankush Mehrotra is recognized as Most read author in Franchising by Quora for 2 consecutive years. With a vision to ‘Empower through Entrepreneurship’ we are striving to build a community of people who are ready to take up the challenge of ...",
    "tags": [
      "business",
      "development",
      "intern",
      "required",
      "franchise",
      "opportunity"
    ],
    "slug": "business-development-intern-required"
  },
  {
    "id": 723,
    "title": "Refund Policy",
    "sector": "Page",
    "description": "Refund Policy- TigerTalk/KYC (No Refund) All products are sold “as is”. You assume the responsibility for your purchase, and no refunds will be issued. Refund Policy (No Refund, Exchange Only) All products are sold “as is”. You assume the responsibility for your purchase, and no refunds will be issued. You may contact us within 15 days from the purchase date if you wish to exchange your purchase for a product of equal or lesser value. If you choose to exchange you purchase for an item of less...",
    "tags": [
      "refund",
      "policy",
      "franchise",
      "business",
      "opportunity"
    ],
    "slug": "refund-policy"
  },
  {
    "id": 782,
    "title": "Software Engineering Interns Required",
    "sector": "Page",
    "description": "General Description: FranTiger Business Consulting seeks to employ an engineering intern to perform several software development tasks for use in business systems involving brand aggregations. Tasks may include development and deployment of web-enabled software for Linux systems, Android systems, web systems, etc. Software will interface with business systems located on the internet, installed locally at FranTiger, and deployed at customer handsets. Primary Job Functions: Work with the engine...",
    "tags": [
      "software",
      "engineering",
      "interns",
      "required",
      "franchise",
      "business",
      "opportunity"
    ],
    "slug": "software-engineering-interns-required"
  },
  {
    "id": 786,
    "title": "Design A Logo Contest",
    "sector": "Page",
    "description": "Logos are the essential and Vital elements of any business or Brand. We understand the importance of the creator or designer of that logo. Logos speaks for themselves, for the brand image and for the founders who have put their time to incubate that brand. We brings you the opportunity to win ₹5,000 and a chance to grab a job offer at most promising Indo-Korean brand house. If you are a designer and know how to play with your tools, then don't wait and submit your logo design. Read about the ...",
    "tags": [
      "design",
      "logo",
      "contest",
      "franchise",
      "business",
      "opportunity"
    ],
    "slug": "design-a-logo-contest"
  },
  {
    "id": 2325,
    "title": "Survive Covid Lockdown Challenge",
    "sector": "Page",
    "description": "Hey, Are you ready to take the Covid-19 lockdown challenge? The following test would determine your chances of survival. Just make your conscious choices and see how your decisions can keep you alive and your family safe. This game has been designed to be played as a protagonist who is living in a slum with family. Step into its shoes and survive. Note:- This is just a data based game created by XR labs, and it doesn't determine your survival amidst lockdown. It has been made to spread awaren...",
    "tags": [
      "survive",
      "covid",
      "lockdown",
      "challenge",
      "franchise",
      "business",
      "opportunity"
    ],
    "slug": "survive-covid-lockdown-challenge"
  },
  {
    "id": 2575,
    "title": "All about Manpower Consulting at frantiger",
    "sector": "Page",
    "description": "A Manpower recruitment consultant is intermediary between “organizations (corporate) i.e. looking forward to recruit staff “and “the people who are looking out for jobs”. In short, manpower consultant has two customers: Their Client and The Candidate. Recruiting through external resources (recruitment consultant) is a lengthy process. In this process corporate gets in touch with the Manpower Recruitment Consultants to know about their charges or mostly recruitment do calls or do meeting with ...",
    "tags": [
      "all",
      "about",
      "manpower",
      "consulting",
      "frantiger",
      "franchise",
      "business",
      "opportunity"
    ],
    "slug": "all-about-manpower-consulting-at-frantiger"
  },
  {
    "id": 2705,
    "title": "KYC-Terms & Conditions",
    "sector": "Page",
    "description": "All the Terms and Conditions are mentioned in the Downloadable KYC form at https://frn.pw/kycform a) Registration Fee*: An upfront non-refundable payment of 11,000/- (Indian Rupees Eleven Thousand Only) plus applicable taxes shall be paid by the Buyer/You at the time of signing of this Agreement. b) Consultation Fee: Upon execution of a deal or token cheque between the Buyer (i.e. You) and the respective business prospect selected and finalized by the Buyer a non-refundable consultation fee/b...",
    "tags": [
      "kycterms",
      "conditions",
      "kyc",
      "terms",
      "franchise",
      "business",
      "opportunity"
    ],
    "slug": "kyc-terms-conditions"
  },
  {
    "id": 2713,
    "title": "🎮 Arcade Adventure Business Plan Competition",
    "sector": "Page",
    "description": "Are you a B-School Maverick with a passion for gaming and a knack for business? Here's your chance to turn your dreams into reality!JTNDJTIxRE9DVFlQRSUyMGh0bWwlM0UlMEElM0NodG1sJTIwbGFuZyUzRCUyMmVuJTIyJTNFJTBBJTNDaGVhZCUzRSUwQSUyMCUyMCUyMCUyMCUzQ21ldGElMjBjaGFyc2V0JTNEJTIyVVRGLTglMjIlM0UlMEElMjAlMjAlMjAlMjAlM0NtZXRhJTIwbmFtZSUzRCUyMnZpZXdwb3J0JTIyJTIwY29udGVudCUzRCUyMndpZHRoJTNEZGV2aWNlLXdpZHRoJTJDJTIwaW5pdGlhbC1zY2FsZSUzRDEuMCUyMiUzRSUwQSUyMCUyMCUyMCUyMCUzQ3RpdGxlJTNFQXJjYWRlJTIwQWR2ZW50dXJlJ...",
    "tags": [
      "arcade",
      "adventure",
      "business",
      "plan",
      "competition",
      "franchise",
      "opportunity"
    ],
    "slug": "ae-arcade-adventure-business-plan-competition"
  }
]